document.addEventListener('DOMContentLoaded', () => {
    const params = new URLSearchParams(window.location.search);
    const name1 = params.get('name1');
    const name2 = params.get('name2');
    const isMine = params.get('isMine');

    // Находим заголовок
    const headingEl = document.querySelector('.wedding__heading_name');
    const wedding__text = document.querySelector('.wedding__text');

    let finalName1;
    let finalName2;

    if (name1 === "Папа Сабины" && name2 === "Мама Сабины") {
        finalName1 = "Папа"
        finalName2 = "Мама"
    } else if (name1 === "Папа Арамиля" && name2 === "Мама Арамиля") {
        finalName1 = "Папа"
        finalName2 = "Мама"
    } else {
        finalName1 = name1
        finalName2 = name2
    }

    const guestsWomen = [
        "Анелия Апа",
        "Айсель",
        "Алёна",
        "Таня",
        "Настя",
        "Люба",
    ]

    // Вставляем правильный текст
    if (name1 && name2) {
        headingEl.textContent = `И приглашаем Вас на нашу свадьбу, дорогие ${finalName1} и ${finalName2}`;
        wedding__text.textContent = `Для нас очень важно,
        чтобы Вы смогли разделить с нами самое счастливое мгновение в нашей жизни. Порадуйте нас
        своим присутствием:`
    } else if (name1) {
        headingEl.textContent = `И приглашаем Тебя на нашу свадьбу, ${finalName1}`;
        wedding__text.textContent = `Для нас очень важно,
        чтобы Ты ${guestsWomen.includes(name1) ? 'смогла' : 'смог'} разделить с нами самое счастливое мгновение в нашей жизни. Порадуй нас
        своим присутствием:`
    } else {
        // Если параметров нет, можно скрыть блок или вставить какое-то дефолтное сообщение
        headingEl.textContent = 'Дорогие друзья, родные и близкие!';
        wedding__text.textContent = `Мы счастливы пригласить вас на нашу свадьбу. Для нас очень важно,
        чтобы вы смогли разделить с нами самое счастливое мгновение в нашей жизни. Порадуйте нас
        своим присутствием:`
    }

    let guestsList;

    const guestsFromMe = [
        "Папа Арамиля",
        "Мама Арамиля",
        "Ралина",
        "Ильяс",
        "Лия",
        "Бабан",
        "Нэнэй",
        "Эндже Апа",
        "Ринат Абый",
        "Альфия Апа",
        "Гульфия Апа",
        "Марсель Абый",
        "Гузель Апа",
        "Искандер",
        "Мадина",
        "Анелия Апа",
        "Никита",
        "Рифхат Абый",
        "Софья Апа",
        "Алмаз Абый",
    ]

    const guestsFromSabina = [
        "Папа Сабины",
        "Мама Сабины",
        "Айсель",
        "Алан",
        "Картэтэй",
        "Нэнэй Ляля",
        "Нэнэй Назифа",
        "Тётя Ирина",
        "Дядя Рушан",
        "Амина",
        "Салима",
        "Тётя Римма",
        "Дядя Ильфат",
        "Наташа",
        "Виктор",
        "Тётя Зиля",
        "Дядя Ринат",
    ]

    const guestsListAramilWithParenst = [
        "Папа",
        "Мама",
        "Алия",
        "Ралина",
        "Ильяс",
        "Лия",
        "Бабан",
        "Нэнэй",
        "Эндже Апа",
        "Ринат Абый",
        "Альфия Апа",
        "Гульфия Апа",
        "Марсель Абый",
        "Гузель Апа",
        "Искандер",
        "Мадина",
        "Анелия Апа",
        "Никита",
        "Рифхат Абый",
        "Софья Апа",
        "Алмаз Абый",
        "Папа Сабины",
        "Мама Сабины",
        "Айсель",
        "Алан",
        "Картэтэй",
        "Нэнэй Ляля",
        "Нэнэй Назифа",
        "Тётя Ирина",
        "Дядя Рушан",
        "Амина",
        "Салима",
        "Тётя Римма",
        "Дядя Ильфат",
        "Наташа",
        "Виктор",
        "Тётя Зиля",
        "Дядя Ринат",
        "Булат",
        "Карен",
        "Максим",
        "Влад",
        "Адель",
        "Азат",
        "Дима",
        "Рома",
        "Анвар",
        "Ислам",
        "Миша",
        "Алишер",
        "Рухшона",
        "Дана",
        "Даниил",
        "Дина",
        "Фанзиль",
        "Вика",
        "Алёна",
        "Таня",
        "Настя",
        "Николай",
        "София",
        "Захар",
        "Люба",
    ];

    const guestsListSabinaWithParents = [
        "Папа",
        "Мама",
        "Айсель",
        "Алан",
        "Картэтэй",
        "Нэнэй Ляля",
        "Нэнэй Назифа",
        "Тётя Ирина",
        "Дядя Рушан",
        "Амина",
        "Салима",
        "Тётя Римма",
        "Дядя Ильфат",
        "Наташа",
        "Виктор",
        "Тётя Зиля",
        "Дядя Ринат",
        "Папа Арамиля",
        "Мама Арамиля",
        "Алия",
        "Ралина",
        "Ильяс",
        "Лия",
        "Бабан",
        "Нэнэй",
        "Эндже Апа",
        "Ринат Абый",
        "Альфия Апа",
        "Гульфия Апа",
        "Марсель Абый",
        "Гузель Апа",
        "Искандер",
        "Мадина",
        "Анелия Апа",
        "Никита",
        "Рифхат Абый",
        "Софья Апа",
        "Алмаз Абый",
        "Булат",
        "Карен",
        "Максим",
        "Влад",
        "Адель",
        "Азат",
        "Дима",
        "Рома",
        "Анвар",
        "Ислам",
        "Миша",
        "Алишер",
        "Рухшона",
        "Дана",
        "Даниил",
        "Дина",
        "Фанзиль",
        "Вика",
        "Алёна",
        "Таня",
        "Настя",
        "Николай",
        "София",
        "Захар",
        "Люба",
    ];

    const guestsListAramil = [
        "Папа Арамиля",
        "Мама Арамиля",
        "Алия",
        "Ралина",
        "Ильяс",
        "Лия",
        "Бабан",
        "Нэнэй",
        "Эндже Апа",
        "Ринат Абый",
        "Альфия Апа",
        "Гульфия Апа",
        "Марсель Абый",
        "Гузель Апа",
        "Искандер",
        "Мадина",
        "Анелия Апа",
        "Никита",
        "Рифхат Абый",
        "Софья Апа",
        "Алмаз Абый",
        "Папа Сабины",
        "Мама Сабины",
        "Айсель",
        "Алан",
        "Картэтэй",
        "Нэнэй Ляля",
        "Нэнэй Назифа",
        "Тётя Ирина",
        "Дядя Рушан",
        "Амина",
        "Салима",
        "Тётя Римма",
        "Дядя Ильфат",
        "Наташа",
        "Виктор",
        "Тётя Зиля",
        "Дядя Ринат",
        "Булат",
        "Карен",
        "Максим",
        "Влад",
        "Адель",
        "Азат",
        "Дима",
        "Рома",
        "Анвар",
        "Ислам",
        "Миша",
        "Алишер",
        "Рухшона",
        "Дана",
        "Даниил",
        "Дина",
        "Фанзиль",
        "Вика",
        "Алёна",
        "Таня",
        "Настя",
        "Николай",
        "София",
        "Захар",
        "Люба",
    ];

    const guestsListSabina = [
        "Папа Сабины",
        "Мама Сабины",
        "Айсель",
        "Алан",
        "Картэтэй",
        "Нэнэй Ляля",
        "Нэнэй Назифа",
        "Тётя Ирина",
        "Дядя Рушан",
        "Амина",
        "Салима",
        "Тётя Римма",
        "Дядя Ильфат",
        "Наташа",
        "Виктор",
        "Тётя Зиля",
        "Дядя Ринат",
        "Папа Арамиля",
        "Мама Арамиля",
        "Алия",
        "Ралина",
        "Ильяс",
        "Лия",
        "Бабан",
        "Нэнэй",
        "Эндже Апа",
        "Ринат Абый",
        "Альфия Апа",
        "Гульфия Апа",
        "Марсель Абый",
        "Гузель Апа",
        "Искандер",
        "Мадина",
        "Анелия Апа",
        "Никита",
        "Рифхат Абый",
        "Софья Апа",
        "Алмаз Абый",
        "Булат",
        "Карен",
        "Максим",
        "Влад",
        "Адель",
        "Азат",
        "Дима",
        "Рома",
        "Анвар",
        "Ислам",
        "Миша",
        "Алишер",
        "Рухшона",
        "Дана",
        "Даниил",
        "Дина",
        "Фанзиль",
        "Вика",
        "Алёна",
        "Таня",
        "Настя",
        "Николай",
        "София",
        "Захар",
        "Люба",
    ];

    const guestsListNormal = [
        "Папа Арамиля",
        "Мама Арамиля",
        "Алия",
        "Ралина",
        "Ильяс",
        "Лия",
        "Бабан",
        "Нэнэй",
        "Эндже Апа",
        "Ринат Абый",
        "Альфия Апа",
        "Гульфия Апа",
        "Марсель Абый",
        "Гузель Апа",
        "Искандер",
        "Мадина",
        "Анелия Апа",
        "Никита",
        "Рифхат Абый",
        "Софья Апа",
        "Алмаз Абый",
        "Папа Сабины",
        "Мама Сабины",
        "Айсель",
        "Алан",
        "Картэтэй",
        "Нэнэй Ляля",
        "Нэнэй Назифа",
        "Тётя Ирина",
        "Дядя Рушан",
        "Амина",
        "Салима",
        "Тётя Римма",
        "Дядя Ильфат",
        "Наташа",
        "Виктор",
        "Тётя Зиля",
        "Дядя Ринат",
        "Булат",
        "Карен",
        "Максим",
        "Влад",
        "Адель",
        "Азат",
        "Дима",
        "Рома",
        "Анвар",
        "Ислам",
        "Миша",
        "Алишер",
        "Рухшона",
        "Дана",
        "Даниил",
        "Дина",
        "Фанзиль",
        "Вика",
        "Алёна",
        "Таня",
        "Настя",
        "Николай",
        "София",
        "Захар",
        "Люба",
    ];

    if (
        name1 && guestsFromMe.includes(name1) &&
        name2 && guestsFromMe.includes(name2) &&
        name1 === "Папа Арамиля" && name2 === "Мама Арамиля"
    ) {
        guestsList = guestsListAramilWithParenst
    } else if (
        name1 && guestsFromSabina.includes(name1) &&
        name2 && guestsFromSabina.includes(name2) &&
        name1 === "Папа Сабины" && name2 === "Мама Сабины"
    ) {
        guestsList = guestsListSabinaWithParents
    } else if (
        name1 && guestsFromMe.includes(name1) &&
        name2 && guestsFromMe.includes(name2)
    ) {
        guestsList = guestsListAramil
    } else if (
        name1 && guestsFromSabina.includes(name1) &&
        name2 && guestsFromSabina.includes(name2)
    ) {
        guestsList = guestsListSabina
    } else if (
        name1 && guestsFromMe.includes(name1)
    ) {
        guestsList = guestsListAramil
    } else if (name1 && guestsFromSabina.includes(name1)) {
        guestsList = guestsListSabina
    } else {
        guestsList = guestsListNormal
    }


    let columnsContainer = document.getElementById('columns');
    let maxPerColumn = window.matchMedia('(max-width: 599px)').matches ? 21  : 10;
    let col;
    guestsList.forEach((name, i) => {
        if (i % maxPerColumn === 0) {
            col = document.createElement('div');
            col.className = 'guests__column';
            columnsContainer.appendChild(col);
        }
        const item = document.createElement('div');
        item.className = 'guests__item';
        item.textContent = name;

        if (
            (finalName1 && name === finalName1) ||
            (finalName2 && name === finalName2)
        ) {
            item.classList.add('gold')
        }
        col.appendChild(item);
    });

})